In [86]:
from datetime import datetime
from datetime import timedelta
import pandas as pd

# How do you get the current date and time using Python's datetime module?

In [3]:
current_datetime = datetime.now()
datetime.now()

datetime.datetime(2024, 8, 26, 15, 44, 25, 969468)

In [18]:
current_datetime.strftime("%Y/%m/%d")

'2024/08/26'

In [113]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Date': [20230801, 20230802, 20230803, 20230804, 20230805],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

In [81]:
df = pd.DataFrame(data)

In [62]:
df

      Name      Date     Location
0    Alice  20230801     New York
1      Bob  20230802  Los Angeles
2  Charlie  20230803      Chicago
3    David  20230804      Houston
4      Eva  20230805      Phoenix

In [193]:
df.dtypes

Name                object
Date        datetime64[ns]
Location            object
dtype: object

In [114]:
df['Date'] = pd.to_datetime(df['Date'].astype(str),format="%Y-%m-%d")

In [115]:
df

      Name       Date     Location
0    Alice 2023-08-01     New York
1      Bob 2023-08-02  Los Angeles
2  Charlie 2023-08-03      Chicago
3    David 2023-08-04      Houston
4      Eva 2023-08-05      Phoenix

In [76]:
df['Date']= df['Date'].dt.strftime('%d-%m-%Y')

In [93]:
# add 5 days
df['Date'] + timedelta(days=1)
df['Date'] + timedelta(days=1, seconds=2, microseconds=3, milliseconds=4, minutes=5, hours=3, weeks=5)

0   2023-09-06 03:05:02.004003
1   2023-09-07 03:05:02.004003
2   2023-09-08 03:05:02.004003
3   2023-09-09 03:05:02.004003
4   2023-09-10 03:05:02.004003
Name: Date, dtype: datetime64[ns]

In [94]:
delta = datetime(2024, 1, 1) - datetime(2023, 1, 1)
difference_in_days = delta.days

In [95]:
difference_in_days

365

In [119]:
df['Date'] - datetime(2023, 7, 1)

0   31 days
1   32 days
2   33 days
3   34 days
4   35 days
Name: Date, dtype: timedelta64[ns]

In [120]:
df['Date'].dt.year

0    2023
1    2023
2    2023
3    2023
4    2023
Name: Date, dtype: int64

In [121]:
df['Date'].dt.month

0    8
1    8
2    8
3    8
4    8
Name: Date, dtype: int64

In [124]:
df['Date'].dt.day

0    1
1    2
2    3
3    4
4    5
Name: Date, dtype: int64

In [135]:
pd.date_range(start = '11-10-2001',end='26-08-2024',freq='Y')

DatetimeIndex(['2001-12-31', '2002-12-31', '2003-12-31', '2004-12-31',
               '2005-12-31', '2006-12-31', '2007-12-31', '2008-12-31',
               '2009-12-31', '2010-12-31', '2011-12-31', '2012-12-31',
               '2013-12-31', '2014-12-31', '2015-12-31', '2016-12-31',
               '2017-12-31', '2018-12-31', '2019-12-31', '2020-12-31',
               '2021-12-31', '2022-12-31', '2023-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [154]:
birth_year = datetime.strptime('11-10-2001','%d-%m-%Y')

today_date = datetime.now()

diff = today_date - birth_year

year = diff.days // 365

month = (diff.days % 365) //30

day = (diff.days % 365) %30

print(f"Hey Shubham you are {year} years {month} months and {day} days year old, Happy {year}'s ")

Hey Shubham you are 22 years 10 months and 25 days year old, Happy 22's

In [155]:
date_string = "2024-08-26"
date_object = datetime.strptime(date_string, "%Y-%m-%d")

In [156]:
date_object

datetime.datetime(2024, 8, 26, 0, 0)

In [159]:
datetime.strptime('2024-08-26','%Y-%m-%d')

datetime.datetime(2024, 8, 26, 0, 0)

# this is the str to datetime

In [160]:
#below is by pd

In [163]:
today = pd.to_datetime('2024-08-26',format='%Y-%m-%d')
pd.to_datetime('2024-08-26',format='%Y-%m-%d')

Timestamp('2024-08-26 00:00:00')

In [170]:
y = datetime.strptime('2024-08-26','%Y-%m-%d')
y.strftime('%Y-%m-%d')

'2024-08-26'

In [165]:
str_today = today.strftime('%Y-%d-%m')
today.strftime('%Y-%d-%m')

'2024-26-08'

In [167]:
today

Timestamp('2024-08-26 00:00:00')

In [166]:
str_today

'2024-26-08'

# datetime.strptime string to datetime

# date.strftime datetime to  formated string

In [171]:
df

      Name       Date     Location
0    Alice 2023-08-01     New York
1      Bob 2023-08-02  Los Angeles
2  Charlie 2023-08-03      Chicago
3    David 2023-08-04      Houston
4      Eva 2023-08-05      Phoenix

In [172]:
df['Date'].dt.to_period('Q')

0    2023Q3
1    2023Q3
2    2023Q3
3    2023Q3
4    2023Q3
Name: Date, dtype: period[Q-DEC]

In [173]:
import pytz
timezone = pytz.timezone("America/New_York")

In [174]:
timezone.localize(current_datetime)

datetime.datetime(2024, 8, 26, 15, 44, 25, 969404, tzinfo=<DstTzInfo 'America/New_York' EDT-1 day, 20:00:00 DST>)

In [181]:
current_datetime.isocalendar()[1]  # .dt.month for dataframe

35

In [182]:
current_datetime.isocalendar()[2] # .dt.day

1

In [184]:
current_datetime.isocalendar()[0] # .dt.year

2024

In [190]:
x,y,z =current_datetime.isocalendar()
current_datetime.isocalendar()

datetime.IsoCalendarDate(year=2024, week=35, weekday=1)

In [189]:
x,y,z

(2024, 35, 1)